import { TextHelper } from '../helpers'

export const MESSAGES_COMMON = {
  GREETING: `Щоб швидко розпочати тренування, пройди, будь ласка, легку реєстрацію. Це займе лише хвилинку 🧘‍♀️💫`,
  VERIFICATION_REQUESTED: `✅ Запит на верифікацію отримано!\nТрішки зачекай — ми швидко перевіримо твої дані.\n\nГотуйся до тренувань! 😉💃`,
  GLOBAL_ERROR: `🥺 Ой! Щось пішло не так, як планувалося.\n\nМи вже знаємо про це і старанно працюємо над тим, щоб все полагодити!🙏\n\nЯкщо у тебе є питання, звертайся до нас, ми завжди поруч! 💕`,
  ACCESS_RESTRICTED: `🚫 На жаль, доступ до бота було обмежено.\n\nЯкщо ти вважаєш, що це помилка, зв'яжись з нами для отримання допомоги. 💌`,
  DATE_ERROR: `Ой-ой! 🥺 Схоже, формат дати не підійшов або дата не вірна.\n\nНам потрібна дата у форматі ДД ММ РРРР (день місяць рік). Спробуй ще раз! 😉`,
  PAYMENT: 'Оплата на карту:\n\n`4441111071326486`\n\nБачинська Наталія\n\nПісля оплати, надішліть, будь ласка, скрін і ми забронюємо за вами місце😌'
} as const

export const MESSAGES_SCENE = {
  REGISTER: {
    PROVIDE_NAME: `Давай познайомимось ближче☺️\n\nВкажи, будь ласка, своє ім'я та прізвище. 💫✨`,
    PROVIDE_PHONE: `⚡️ Вкажи, будь ласка, свій номер телефону щоб ми могли бути на зв’язку, якщо раптом буде зміна в розкладі або щось термінове 💖\n\nВажливо! ☝️ Введи номер без +38 та без зайвих символів — тільки 10 цифр.\nНаприклад: 0661597050`,
    PROVIDE_PHONE_ERROR: `Важливо! ☝️ Введи номер без +38 та без зайвих символів — тільки 10 цифр.\nНаприклад: 0661597050`,
    PROVIDE_DOB: `Будь ласка, вкажи дату народження, щоб ми могли врахувати вікові обмеження.\n🗒 Формат: ДД ММ РРРР\nНе хвилюйся — твої дані в безпеці 🔒🫶🏻`,
    COMPLETE: `💌 Запит на верифікацію надіслано\nОчікуй на підтвердження! 😊`,
    COMPLETE_GUEST: `✅ Реєстрація успішна`,
    EXIT: `ℹ️ Процес реєстрації було припинено\n\nНе хвилюйся, ти завжди можеш повернутись та завершити її в будь-який момент! 🤸‍♀️🌟`,
  },
  VERIFY_CLIENT: {
    SELECT_PASS_TYPE: `🧚‍♀️ Обери тип абонементу`,
    SELECT_PASS: `🧚‍♀️ Обери абонемент який прикріпити за клієнтом`,
    NO_PASS_TEMPLATES: `Немає доступних абонементів для вибору.`,
    PROVIDE_PASS_START_DATE: `📅 Вкажи дату початку дії абонементу\n\n${TextHelper.italic('Формат: ДД.ММ.РРРР')}`,
    PROVIDE_PASS_EXPIRATION_DATE: `📅 Вкажи дату закінчення дії абонементу\n\n${TextHelper.italic('Формат: ДД.ММ.РРРР')}`,
    COMPLETE: `✅ Клієнт успішно верифікований`,
    EXIT: `ℹ️ Процес верифікації було припинено`,
  },
  VERIFY_TRAINER: {
    EXIT: `ℹ️ Процес верифікації було припинено`,
  },
}

export const RULES = `ПРАВИЛА СТУДІЇ:

📆 Перенесення / скасування
заняття щонайменше за 4 години до початку.

🧼Приходь у зручному одязі і не забудь чисте змінне взуття. Це про комфорт і повагу до кожного 😄

🎫 Абонемент — це мультипас: можеш ходити на будь-які тренування у своїй віковій категорії. Діє 30 днів, рахуючи з першого заняття.

Як тільки ти купляєш абонемент, у тебе є 7 днів, аби його активувати.

Купуючи абонемент у день пробного тренування ти отримуєш знижку 250₴! Так, так, тобі не почулось, а отже пробне заняття буде у подарунок 🎁 

Активується автоматично після першого тренування.

Пропущене? Не біда — можна відпрацювати з іншою групою до завершення терміну.

Заморожувати або продовжувати абонемент не можна, чесно-чесно, ну зовсім ніяк 🧊🚫

Абонемент — персональний, як улюблена пляшка для води. Не передавай його нікому, будь ласка 🙏

Повернення коштів за абонементи чи пробні заняття не передбачено — ми залишаємо за собою право на серйозність у цьому пункті 😌

Заняття, які ти не використовуєш, поки абонемент ще діє — згорають. Знаємо, сумно, але яка ж чудова мотивація не пропускати тренування)
Потрапити на тренування можна тільки після запису у нашому боті. Не забувай, будь ласка, це важливий момент🙌🏻

🔁 Не зайшло заняття?
Ти завжди можеш спробувати інший напрямок — ми за експерименти 💃

📱Ми не відповідаємо за особисті речі — тому, будь другом, бери телефон та інші коштовні штуки з собою в зал. Спокій важливий 💼❤️

Купуючи абонемент — погоджуєшся з цими правилами✨

До зустрічі на заняттях, твоя 
${TextHelper.italic('era team')}🩷`

//✨П’ятниця, 6 червня, 18:00
/**
 * 

З Днем народження, era girl!🥳

Нехай кожен день наближає тебе до мрій. Будь своєю музою, своїм натхненням і головною героїнею власного життя.
Ми раді бути поруч на цьому шляху ✨

З любов’ю, команда ERA💖


Привіт, Анастасія!
Ми дуже хочемо почути твою думку — залиш, будь ласка, відгук про тренування або студію загалом.
Твої слова допомагають нам ставати кращими! 🙌💖 — хочемо періодично робити розсилку з залишити відгук опцією)

 */
