import { TextHelper } from '../helpers'

export const MESSAGES_COMMON = {
  GREETING: `🌸 Вітаємо в ERA Studio!\n\nЩоб швидко розпочати тренування, пройдіть, будь ласка, легку реєстрацію. Це зовсім не складно! 🧘‍♀️💫`,
  VERIFICATION_REQUESTED: `🚀 Твій запит вже летить на верифікацію!\n\nОбробка займає трохи часу, але ми дуже швидко підтвердимо твій аккаунт.\n\nГотуйся до тренувань! 😉💃`,
  GLOBAL_ERROR: `🥺 Ой! Щось пішло не так, як планувалося.\n\nМи вже знаємо про це і старанно працюємо над тим, щоб все полагодити!🙏\n\nЯкщо у тебе є питання, звертайся до нас, ми завжди поруч! 💕`,
} as const


export const MESSAGES_SCENE = {
  VERIFICATION: {
    PROVIDE_NAME: `👋 Давай знайомитися!\n\nВкажи, будь ласка, своє ім'я та прізвище. 💫✨`,
    PROVIDE_PHONE: `⚡️ Вкажіть, будь ласка, свій номер телефону, щоб ми могли миттєво зв'язатися з вами у разі непередбачених ситуацій або термінових змін у розкладі.\n\nЗавжди на зв'язку! 📞🛡️💖`,
    PROVIDE_DOB: `Будь ласка, вкажіть дату народження для врахування вікових обмежень.\n\n${TextHelper.italic('Формат: ДД.ММ.РРРР')}\n\nКонфіденційність гарантовано! 🔒🙏`,
    COMPLETE: `✅ Запит на верифікацію надіслано\n\nОчікуйте підтвердження! 😊`,
    EXIT: `ℹ️ Процес верифікації було припинено\n\nНе хвилюйся, ти завжди можеш повернутися та завершити її в будь-який момент! 🤸‍♀️🌟`
  }
}