export const MESSAGES_COMMON = {
  VERIFICATION_REQUESTED: `🚀 Твій запит вже летить на верифікацію!\n\nОбробка займає трохи часу, але ми дуже швидко підтвердимо твій аккаунт.\n\nГотуйся до тренувань! 😉💃`,
  GLOBAL_ERROR: `🥺 Ой! Щось пішло не так, як планувалося.\n\nМи вже знаємо про це і старанно працюємо над тим, щоб все полагодити!🙏\n\nЯкщо у тебе є питання, звертайся до нас, ми завжди поруч! 💕`,
} as const


export const MESSAGES_SCENE = {
  VERIFICATION: {
    PROVIDE_NAME: `👋 Давай знайомитися! Вкажи, будь ласка, своє ім'я та прізвище. 💫✨`
  }
} as const