import { TextHelper } from '../helpers'

export const MESSAGES_COMMON = {
  GREETING: `Щоб швидко розпочати тренування, пройди, будь ласка, легку реєстрацію. Це займе лише хвилинку 🧘‍♀️💫`,
  VERIFICATION_REQUESTED: `✅ Запит на верифікацію отримано!\nТрішки зачекай — ми швидко перевіримо твої дані. 😉`,
  GLOBAL_ERROR: `🥺 Ой! Щось пішло не так, як планувалося.\n\nМи вже знаємо про це і старанно працюємо над тим, щоб все полагодити!🙏\n\nЯкщо у тебе є питання, звертайся до нас, ми завжди поруч! 💕`,
  ACCESS_RESTRICTED: `🚫 На жаль, доступ до бота було обмежено.\n\nЯкщо ти вважаєш, що це помилка, зв'яжись з нами для отримання допомоги. 💌`,
  DATE_ERROR: `Ой-ой! 🥺 Схоже, формат дати не підійшов або дата не вірна.\n\nНам потрібна дата у форматі ДД ММ РРРР (день місяць рік). Спробуй ще раз! 😉`,
  PAYMENT:
    'Оплата на рахунок:\n\n**Отримувач:**\nБАЧИНСЬКА НАТАЛІЯ ОЛЕГІВНА\n\n**IBAN:**\n`UA043052990000026000011051148`\n\n**РНОКПП/ЄДРПОУ:**\n3777204929\n\n📌 **Призначення платежу:**\nОплата за послуги [ваше прізвище]\n\n📱 Після оплати збережіть скріншот підтвердження, він знадобиться для покупки чи поновлення абонементу ✨',
  PAYMENT_GUEST:
    'Оплата на рахунок:\n\n**Отримувач:**\nБАЧИНСЬКА НАТАЛІЯ ОЛЕГІВНА\n\n**IBAN:**\n`UA043052990000026000011051148`\n\n**РНОКПП/ЄДРПОУ:**\n3777204929\n\n📌 **Призначення платежу:**\nОплата за послуги [ваше прізвище]\n\n📱 Після оплати збережіть скріншот підтвердження, він знадобиться для запису на тренування ✨',
  BIRTHDAY_MESSAGE: `З Днем народження, era girl!🥳\n\nНехай кожен день наближає тебе до мрій. Будь своєю музою, своїм натхненням і головною героїнею власного життя.\nМи раді бути поруч на цьому шляху ✨\n\nЗ любов’ю, команда <i>ERA</i>💖`,
} as const

export const MESSAGES_CLIENT = {
  NO_ACTIVE_SIGNUPS: `Поки що жодних записів немає 📅\n\Але це легко виправити — обирай та записуйся! 💫`,
  ACTIVE_SIGNUPS: `Ось твої активні записи на тренування 📅\n\nЯкщо хочеш скасувати запис, просто обери потрібне тренування зі списку нижче 👇`,
  CHOOSE_GROUP: `Обери групу, на яку хочеш записатись 💓`,
  CHOOSE_TRAINING: `Обери тренування, на яке хочеш записатись 🔥`,
  NO_GROUPS: `На жаль, немає доступних груп для запису. 😔`,
  NO_ACTIVE_PASS: `Ой-ой! 🤸‍♀️\n\nПоки що не бачу твого активного абонементу 😔`,
  NO_TRAININGS: `У цій групі поки немає доступних занять для твого абонементу 😔\n\nСпробуй іншу групу або зачекай нових занять! ✨`,
  ONE_SCHEDULE_REMAINING: `Вітаю, запис успішний!🤗\n\nУ тебе залишився 1 доступний запис на тренування в межах даного абонемента🛎`,
} as const

export const MESSAGES_STAFF = {
  GREETINGS_ADMIN: `Вітаю в кабінеті адміністратора! 👩‍💼✨`,
  GREETINGS_MAINTAINER: `Вітаю в кабінеті суперадміністратора! 👑✨`,
  GREETINGS_TRAINER: `Вітаю в кабінеті тренера! 👨‍🏫✨`,
  VERIFY_SUCCESS: `Верифікація пройшла успішно 💫`,
} as const

export const MESSAGES_SCENE = {
  REGISTER: {
    PROVIDE_NAME: `Давай познайомимось ближче☺️\n\nВкажи, будь ласка, своє ім'я та прізвище. 💫✨`,
    PROVIDE_PHONE: `⚡️ Вкажи, будь ласка, свій номер телефону щоб ми могли бути на зв’язку, якщо раптом буде зміна в розкладі або щось термінове 💖\n\nВажливо! ☝️ Введи номер без +38 та без зайвих символів — тільки 10 цифр.\nНаприклад: 0661597050`,
    PROVIDE_PHONE_ERROR: `Важливо! ☝️ Введи номер без +38 та без зайвих символів — тільки 10 цифр.\nНаприклад: 0661597050`,
    PROVIDE_DOB: `Будь ласка, вкажи дату народження, щоб ми могли врахувати вікові обмеження.\n🗒 Формат: ДД ММ РРРР\nНе хвилюйся — твої дані в безпеці 🔒🫶🏻`,
    COMPLETE: `💌 Запит на верифікацію надіслано\nОчікуй на підтвердження! 😊`,
    COMPLETE_GUEST: `✅ Реєстрація успішна`,
    EXIT: `ℹ️ Процес реєстрації було припинено\n\nНе хвилюйся, ти завжди можеш повернутись та завершити її в будь-який момент! 🤸‍♀️🌟`,
  },
  VERIFY_CLIENT: {
    SELECT_PASS_TYPE: `🧚‍♀️ Обери тип абонементу`,
    SELECT_PASS: `🧚‍♀️ Обери абонемент який прикріпити за клієнтом`,
    NO_PASS_TEMPLATES: `😔 Немає доступних абонементів для вибору.`,
    COMPLETE: `✅ Клієнт успішно верифікований`,
    EXIT: `ℹ️ Процес верифікації було припинено`,
  },
  INITIATE_PAYOUT: {
    ENTER_PAYOUT_DATE: `Коли виплачуємо зарплату? 📅\n\nВведи дату у форматі ДД ММ РРРР:`,
    ERROR_NO_STAFF_ID: `Щось пішло не так 🤔\n\nНе вдається знайти співробітника.`,
    ERROR_NO_STAFF_PROFILE: `Не можу знайти профіль 😕 Спробуй ще раз!`,
    ERROR_PAYOUT_CALCULATION: `Не вдалося розрахувати суму оплати 💸\n\nСпробуй ще раз або зверніться до технічної підтримки.`,
    ERROR_PAYOUT_REGISTER: `Оплату не вдалося зареєструвати 📝\n\nСпробуй ще раз або зверніться до технічної підтримки.`,
    PAYOUT_ALREADY_REGISTERED: `Оплата на цю дату вже існує! 👌`,
    REGISTER_SUCCESS: `Готово! Оплата зареєстрована 🎉`,
    EXIT: `Реєстрацію оплати скасовано 🚪`,
  },
  EDIT_ENTITIES: {
    NO_INITIAL_DATA: `Щось пішло не так 🤔\n\nНе вдається знайти дані для редагування.`,
    EXIT: `Дію скасовано 🚪`,
  },
  PAYMENT: {
    PASS_PURCHASE_WELCOME: `Ласкаво просимо до процесу покупки абонементу! 🎉\n\nТут ти зможеш обрати тип абонементу, переглянути доступні варіанти та завантажити підтвердження оплати. Все просто і швидко! 🚀\n\nЯкщо в тебе виникнуть питання, не соромся звертатися за допомогою. Ми тут, щоб зробити твій досвід максимально приємним! 😊`,
    SELECT_PASS_TYPE: `🧚‍♀️ Обери тип абонементу (Груповий/Персональний)`,
    SELECT_PASS_TEMPLATE: `🧚‍♀️ Обери, будь ласка, абонемент який хочеш придбати`,
    NO_PASS_TEMPLATES: `😔 Немає доступних абонементів для вибору.`,
    PASS_PURCHASE_EXIT: `ℹ️ Процес покупки абонементу було припинено\n\nНе хвилюйся, ти завжди можеш повернутись та завершити його в будь-який момент! 🤸‍♀️🌟`,
    PASS_RENEW_EXIT: `ℹ️ Процес поновлення абонементу було припинено\n\nНе хвилюйся, ти завжди можеш повернутись та завершити його в будь-який момент! 🤸‍♀️🌟`,
    PASS_REQUEST_SUCCESS: `✅ Запит на покупку абонементу отримано!\n\nМи швидко перевіримо твою оплату. 😉\n\nЯкщо все вірно, ми активуємо твій абонемент і повідомимо тебе! 📲`,
    PASS_RENEW_SUCCESS: `✅ Запит на поновлення абонементу отримано!\n\nМи швидко перевіримо твою оплату. 😉\n\nЯкщо все вірно, ми активуємо твій абонемент і повідомимо тебе! 📲`,
    PASS_RENEW_WELCOME: `Ласкаво просимо до процесу поновлення абонементу! 🎉\n\nЯкщо в тебе виникнуть питання, не соромся звертатися за допомогою. Ми тут, щоб зробити твій досвід максимально приємним! 😊`,
  },
  PASS_OPEN: {
    WELCOME: `🌟 Відкриття нового абонементу`,
    SELECT_PASS_TYPE: `🧚‍♀️ Обери тип абонементу для клієнта`,
    SELECT_PASS: `🧚‍♀️ Обери абонемент який буде прикріплено до клієнта`,
    NO_PASS_TEMPLATES: `😔 Немає доступних шаблонів абонементів для відкриття.`,
    COMPLETE: `✅ Абонемент успішно відкрито для клієнта`,
    EXIT: `ℹ️ Відкриття абонементу скасовано`,
  },
  SPECIAL_SCHEDULE: {
    EXIT: `Процес запису на тренування було припинено 🚪`,
    NO_TRAINING_FOUND: `Не вдається знайти тренування. 😔`,
    NO_GROUP_FOUND: `Не вдається знайти групу. 😔`,
    ENTER_CLIENT_NAME: `👤 Введи ім'я людини для запису на тренування\n\n💡 Можеш вказати повне ім'я та/або додати примітку в дужках\n\nНаприклад: "Олена Коваленко" або "Андрій (пробне тренування)"`,
  },
} as const

export const RULES = `📌 ${TextHelper.bold('Організаційні моменти:')}
🔸 Потрапити на тренування можна тільки після запису у нашому боті. Не забувай, будь ласка, це важливий момент🙌🏻
🔸 Не зайшло заняття? Ти завжди можеш спробувати інший напрямок — ми за експерименти 💃
🔸 Ми не відповідаємо за особисті речі — забирай телефон та коштовності із собою в зал 💼❤️

${TextHelper.bold('Про абонемент:')}
🔹 Абонемент активується автоматично після першого тренування або через 7 днів після покупки
🔹 Він діє 30 днів з моменту активації
🔹 Дає доступ до будь-яких занять у твоїй віковій категорії
🔹 Купуючи абонемент у день пробного тренування ти отримуєш знижку 250₴! Так, так, тобі не почулось, а отже пробне заняття буде у подарунок 🎁
🔹 Абонемент — персональний, як улюблена пляшка для води. Не передавай його нікому, будь ласка 🙏
🔹 Заморожувати або продовжувати абонемент не можна, чесно-чесно, ну зовсім ніяк 🧊🚫
🔹 Заняття, які ти не використовуєш, поки абонемент ще діє — згорають. Знаємо, сумно, але яка ж чудова мотивація не пропускати тренування)

${TextHelper.bold('Запізнення / Скасування:')}
🔸 Переносити або скасовувати тренування можна щонайменше за 6 годин до початку
🔸 Пропустила? Не проблема  — можна відпрацювати з іншою групою до завершення дії абонемента

${TextHelper.bold('На занятті:')}
🔹 Приходь у зручному одязі і не забудь чисте змінне взуття. Це про комфорт і повагу до кожного 🦋
🔹 Для занять High Heels — накаблучники на підборах обов’язкові

${TextHelper.bold('Оплата і повернення:')}
🔸 Повернення коштів за абонементи чи пробні заняття не передбачено — ми залишаємо за собою право на серйозність у цьому пункті 😌

Купуючи абонемент, ти погоджуєшся з цими умовами🙌🏻

До зустрічі на тренуваннях!
З любов’ю, твоя ${TextHelper.italic('era team')} 🩷`
