import { TextHelper } from '../helpers'

export const MESSAGES_COMMON = {
  GREETING: `🌸 Вітаємо в ERA Studio!\n\nЩоб швидко розпочати тренування, пройдіть, будь ласка, легку реєстрацію. Це зовсім не складно! 🧘‍♀️💫`,
  VERIFICATION_REQUESTED: `🚀 Твій запит вже летить на верифікацію!\n\nОбробка займає трохи часу, але ми дуже швидко підтвердимо твій аккаунт.\n\nГотуйся до тренувань! 😉💃`,
  GLOBAL_ERROR: `🥺 Ой! Щось пішло не так, як планувалося.\n\nМи вже знаємо про це і старанно працюємо над тим, щоб все полагодити!🙏\n\nЯкщо у тебе є питання, звертайся до нас, ми завжди поруч! 💕`,
  ACCESS_RESTRICTED: `🚫 На жаль, доступ до бота було обмежено.\n\nЯкщо ти вважаєш, що це помилка, зв'яжись з нами для отримання допомоги. 💌\n\nДякуємо за розуміння! 🙏`,
} as const

export const MESSAGES_SCENE = {
  REGISTER: {
    PROVIDE_NAME: `👋 Давай знайомитися!\n\nВкажи, будь ласка, своє ім'я та прізвище. 💫✨`,
    PROVIDE_PHONE: `⚡️ Вкажи, будь ласка, свій номер телефону, щоб ми могли миттєво зв'язатися з вами у разі непередбачених ситуацій або термінових змін у розкладі.\n\nВажливо! ☝️ Введіть номер без коду країни (+38) та інших знаків, лише 10 цифр (наприклад, 0661597050).\n\nЗавжди на зв'язку! 📞🛡️💖`,
    PROVIDE_PHONE_ERROR: `Ой-ой! 🥺 Схоже, формат номера телефону не підійшов.\n\nНам потрібен номер у форматі 0677599050 (без коду країни та інших знаків). Спробуй ще раз! 😉`,
    PROVIDE_DOB: `Будь ласка, вкажи дату народження для врахування вікових обмежень.\n\n${TextHelper.italic('Формат: ДД ММ РРРР')}\n\nКонфіденційність гарантовано! 🔒🙏`,
    PROVIDE_DOB_ERROR: `Ой-ой! 🥺 Схоже, формат дати народження не підійшов.\n\nНам потрібна дата у форматі ДД ММ РРРР (день місяць рік). Спробуй ще раз! 😉`,
    COMPLETE: `✅ Запит на верифікацію надіслано\n\nОчікуй на підтвердження! 😊`,
    COMPLETE_GUEST: `✅ Реєстрація успішна`,
    EXIT: `ℹ️ Процес реєстрації було припинено\n\nНе хвилюйся, ти завжди можеш повернутись та завершити її в будь-який момент! 🤸‍♀️🌟`,
  },
}

export const RULES = `ПРАВИЛА СТУДІЇ:

📆 Перенесення / скасування
заняття щонайменше за 4 години до початку.

🧼Приходь у зручному одязі і не забудь чисте змінне взуття. Це про комфорт і повагу до кожного 😄

🎫 Абонемент — це мультипас: можеш ходити на будь-які тренування у своїй віковій категорії. Діє 30 днів, рахуючи з першого заняття.

Як тільки ти купляєш абонемент, у тебе є 7 днів, аби його активувати.

Купуючи абонемент у день пробного тренування ти отримуєш знижку 250₴! Так, так, тобі не почулось, а отже пробне заняття буде у подарунок 🎁 

Активується автоматично після першого тренування.

Пропущене? Не біда — можна відпрацювати з іншою групою до завершення терміну.

Заморожувати або продовжувати абонемент не можна, чесно-чесно, ну зовсім ніяк 🧊🚫

Абонемент — персональний, як улюблена пляшка для води. Не передавай його нікому, будь ласка 🙏

Повернення коштів за абонементи чи пробні заняття не передбачено — ми залишаємо за собою право на серйозність у цьому пункті 😌

Заняття, які ти не використовуєш, поки абонемент ще діє — згорають. Знаємо, сумно, але яка ж чудова мотивація не пропускати тренування)
Потрапити на тренування можна тільки після запису у нашому боті. Не забувай, будь ласка, це важливий момент🙌🏻

🔁 Не зайшло заняття?
Ти завжди можеш спробувати інший напрямок — ми за експерименти 💃

📱Ми не відповідаємо за особисті речі — тому, будь другом, бери телефон та інші коштовні штуки з собою в зал. Спокій важливий 💼❤️

Купуючи абонемент — погоджуєшся з цими правилами✨

До зустрічі на заняттях, твоя 
${TextHelper.italic('era team')}🩷`
